In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Collecting sqlparse
  Downloading sqlparse-0.4.1-py3-none-any.whl (42 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: ipython>=1.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: six in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.tar.bz2 (21 kB)
Requirement already satisfied: backcall in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: traitlets>=4.2 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: decorator in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: jedi>=0.10 in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: pickleshare in c:\users\acer\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: wcwidth in c:\users\acer\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\acer\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13705 sha256=19f1ee7204a870a3d0f19de212da50932e57b8e4ac0f65dd9476998ef3b8f5a9
  Stored in directory: c:\users\acer\appdata\local\pip\cache\wheels\46\60\6c\bb25d05df22906786206e901e9354bb3061061191116768bee
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1

In [2]:
 %load_ext sql

In [3]:
%sql sqlite://

In [4]:
%%sql   
CREATE TABLE EMPLOYEE(firstname varchar(50),lastname varchar(50));  
INSERT INTO EMPLOYEE VALUES('Tom','Mitchell');  
INSERT INTO EMPLOYEE VALUES('Jack','Ryan');

 * sqlite://
Done.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql SELECT * from EMPLOYEE;

 * sqlite://
Done.

[('Tom', 'Mitchell'), ('Jack', 'Ryan')]

In [11]:
import pandas as pd
import sqlite3

# Read sqlite query results into a pandas DataFrame
con = sqlite3.connect(r"C:\Users\acer\Documents\misdocumentos\MATERIAL DE ESTUDIO\SQL_PRACTICE_1\SQL_SAFI.sqlite")

In [14]:
df = pd.read_sql_query("SELECT * from Crops", con)
df

       Id  plot_Id  crop_Id  D05_times D_curr_crop  D_repeat_times_count
0       1        1        1          1       maize                     1
1       1        2        1          1       maize                     1
2       2        1        1          1       maize                     1
3       2        2        1          1    tomatoes                     1
4       2        3        1          1   vegetable                     1
...   ...      ...      ...        ...         ...                   ...
1039  349        1        2          1     sorghum                     1
1040  349        2        1          1        rice                     1
1041  350        1        1          1       maize                     1
1042  350        2        1          1     sorghum                     1
1043  350        3        1          1        rice                     1

[1044 rows x 6 columns]

In [18]:
# %sql select * from Crops where D_curr_crop = "maize" AND ID <= 3;
df2 = pd.read_sql_query("select * from Crops where D_curr_crop = 'maize' AND ID <= 3", con)
df2

   Id  plot_Id  crop_Id  D05_times D_curr_crop  D_repeat_times_count
0   1        1        1          1       maize                     1
1   1        2        1          1       maize                     1
2   2        1        1          1       maize                     1
3   3        1        1          1       maize                     1